import java.util.Scanner;

public class Main {
    /*
    План занятия
    1) Игра Лотерея
     */


    /*
    Теория
    Архитектура приложения:
    1) Создать класс для игры
    1.1) Методы игры
    1.2) Данные
    2) В главном методу запустить пользовательский(главный) цикл
    3) Создать объект класса и воспользоваться им

    Техническое задание(ТЗ) - это требуемый набор функционала для проекта

    Составим ТЗ для игры:
    1) Генерация выигрышной комбинации
    2) Ввод комбинации пользователя
    3) Проверка комбинации пользователя
    4) Метод для просмотра выигрышной комбинации
    5) Определение результатов и их вывод

    Реализация класса Lottery:
    1) Создать сканер
    2) Создать Random
    3) Создать методы выполняющие подзадачу
    4) Создать массивы для хранения комбинаций

     */

    /*
    Заметки

     */

    /*
    Задачи со звездочкой
    Сделать лотерею с диалоговыми окнами
     */

    public static void main(String[] args) {
        GameHandling gameHandling = new GameHandling();                                      // Создаем объект класса GameHandling - запускаем игру

    }

}
